[
{"title": "Principal–Agent Theory, Game Theory, and the Precautionary Principle", "abstract": "Principal–agent theory and game theory are applied to the precautionary principle (PP) to open up a new research agenda. Principals assess whether the threat is uncertain above a threshold. If it is, the principals choose, pay, and command agents to decrease the uncertainty below the threshold. The agents perform the action. The process is repeated through a feedback loop impacting the threat, after which the process is renewed. The four dimensions of the PP, that is, threat, uncertainty, command, and action, are described. Games and game characteristics in the four dimensions are recognized. Games are possible between natural, technological, and human factors causing the threat and between principals, agents, and external actors. Moral hazard and adverse selection in principal–agent theory related to the PP are considered. Twelve kinds of uncertainty are identified for principal–agent theory in the PP, that is, the natures of the threat, uncertainty, and threshold; states of nature, technology, knowledge, and information; whether a game is played; players; which game is played; strategy sets; utilities; beliefs; incomplete information; imperfect information; risk attitudes; and bounded rationality.", "published": "3 May "},
{"title": "On the Geometry of Nash and Correlated Equilibria with Cumulative Prospect Theoretic Preferences", "abstract": "It is known that the set of all correlated equilibria of an ", "published": "5 Apr "},
{"title": "The Myopic Property in Decision Models", "abstract": "We examine conditions under which decisions made in isolation provide an optimal strategy for the multiperiod problem. We focus on investment decisions with constant returns to scale. We first consider the framework of subjective expected utility. Under minimal assumptions (i.e., without assuming utility is concave), we prove that ", "published": "6 Apr "},
{"title": "Gulf Coast Port Selection Using Multiple-Objective Decision Analysis", "abstract": "In today’s competitive global markets, ports play a vital role in global supply chain operations. A port selection model was developed to demonstrate the potential to aid shipping line companies with decisions to select the best ports in the U.S. Gulf Coast. Because port selection is complex, is dynamic, and includes multiple objectives, a multiple-objective decision analysis quantified the value of the various ports using industry data and an industry expert’s knowledge. In addition, a corresponding cost model was developed using available cost data for each port. Monte Carlo simulation analyzed the uncertainties in the value and cost models. For the demonstration model scenario assumptions, the results show that the Houston port would be the best alternative for shipping lines in the Gulf Coast. The value model also identified opportunities for improvement for each port compared with the best West Coast port. The 8demonstration models show that port data exist to support the development of a multiple-objective decision analysis model and a cost model that can provide useful insights to port selection decision makers. Furthermore, these models can be easily tailored to support port selection in other regions by tailoring the objectives and measures to the decision-maker objectives.", "published": " May "}
]
